db/hpmysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2021-02-13 Sat 00:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>High Performance MySQL</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="database, mysql, performance" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">High Performance MySQL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org887a048">1. Special SQL</a>
<ul>
<li><a href="#orgf142284">1.1. AUTOCOMMIT</a></li>
<li><a href="#orge60182c">1.2. Set isolation level</a></li>
</ul>
</li>
<li><a href="#org2c6776b">2. Storage Engine</a>
<ul>
<li><a href="#orga69fbb2">2.1. Change engine</a></li>
</ul>
</li>
<li><a href="#org21c9fd1">3. Benchmark</a>
<ul>
<li><a href="#orgb918a3b">3.1. What to Measure</a></li>
<li><a href="#org59309a1">3.2. Gathering Data on MySQL</a></li>
<li><a href="#org7635523">3.3. Analyzing Results</a></li>
<li><a href="#org81bec8c">3.4. Tools</a></li>
</ul>
</li>
<li><a href="#org2ea7981">4. Profiling</a>
<ul>
<li><a href="#org7a3113e">4.1. slow query log</a></li>
<li><a href="#org0c0333e">4.2. Single Query Profiling</a></li>
<li><a href="#org35d3f36">4.3. Server-Wide Problem Detection</a></li>
<li><a href="#org82e3630">4.4. Tools</a></li>
</ul>
</li>
<li><a href="#org0f5d093">5. Schema</a>
<ul>
<li><a href="#org272698a">5.1. Data Type</a></li>
<li><a href="#orgea54d6f">5.2. Normalization and Denormalization</a></li>
<li><a href="#orge0c3305">5.3. Summary Table &amp; Cache Table</a></li>
<li><a href="#org34b1ea3">5.4. Speeding Up ALTER TABLE</a></li>
<li><a href="#org998a299">5.5. Indexing Methods</a></li>
<li><a href="#org0cb66e4">5.6. Indexing Strategies</a></li>
<li><a href="#org923cef0">5.7. Clustered Indexes</a></li>
<li><a href="#org2727701">5.8. Covering Indexes</a></li>
<li><a href="#org267a0c3">5.9. Using Index for Sorts</a></li>
</ul>
</li>
<li><a href="#org76676a5">6. Query Optimization</a>
<ul>
<li><a href="#org2e43406">6.1. Isolating the Column</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org887a048" class="outline-2">
<h2 id="org887a048"><span class="section-number-2">1</span> Special SQL</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf142284" class="outline-3">
<h3 id="orgf142284"><span class="section-number-3">1.1</span> AUTOCOMMIT</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql">SHOW VARIABLES <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'AUTOCOMMIT'</span>;
<span style="color: #3a81c3; font-weight: bold;">SET</span> AUTOCOMMIT = 1;
</pre>
</div>
</div>
</div>
<div id="outline-container-orge60182c" class="outline-3">
<h3 id="orge60182c"><span class="section-number-3">1.2</span> Set isolation level</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SET</span> <span style="color: #3a81c3; font-weight: bold;">SESSION</span> <span style="color: #3a81c3; font-weight: bold;">TRANSACTION</span> <span style="color: #3a81c3; font-weight: bold;">ISOLATION</span> <span style="color: #3a81c3; font-weight: bold;">LEVEL</span> <span style="color: #3a81c3; font-weight: bold;">READ</span> <span style="color: #3a81c3; font-weight: bold;">COMMITTED</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2c6776b" class="outline-2">
<h2 id="org2c6776b"><span class="section-number-2">2</span> Storage Engine</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>InnoDB</li>
<li>MyISAM</li>
<li>Archive</li>
<li>OLTP: XtraDB, TokuDB, like InnoDB</li>
<li>Infobright: Column-oriented</li>
<li>Aria: successor to MyISAM, crash-safe</li>
<li>MySQL Cluster</li>
</ul>
</div>

<div id="outline-container-orga69fbb2" class="outline-3">
<h3 id="orga69fbb2"><span class="section-number-3">2.1</span> Change engine</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orga373acb" class="outline-4">
<h4 id="orga373acb"><span class="section-number-4">2.1.1</span> ALTER TABLE</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">ALTER</span> <span style="color: #3a81c3; font-weight: bold;">TABLE</span> <span style="color: #6c3163; font-weight: bold;">mytable</span> ENGINE = InnoDB;
</pre>
</div>
<ul class="org-ul">
<li>row-by-row copy</li>
<li>inplace and slow</li>
</ul>
</div>
</div>
<div id="outline-container-orgc746540" class="outline-4">
<h4 id="orgc746540"><span class="section-number-4">2.1.2</span> Dump and import</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Use <b>mysqldump</b>
</p>
<ol class="org-ol">
<li>dump to text</li>
<li>change create sql</li>
<li>import</li>
</ol>
</div>
</div>
<div id="outline-container-org4036f1d" class="outline-4">
<h4 id="org4036f1d"><span class="section-number-4">2.1.3</span> CREATE and SELECT</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">CREATE</span> <span style="color: #3a81c3; font-weight: bold;">TABLE</span> <span style="color: #6c3163; font-weight: bold;">innodb_table</span> <span style="color: #3a81c3; font-weight: bold;">LIKE</span> myisam_table;
<span style="color: #3a81c3; font-weight: bold;">ALTER</span> <span style="color: #3a81c3; font-weight: bold;">TABLE</span> <span style="color: #6c3163; font-weight: bold;">innodb_table</span> ENGINE=InnoDB;
<span style="color: #3a81c3; font-weight: bold;">INSERT</span> <span style="color: #3a81c3; font-weight: bold;">INTO</span> innodb_table <span style="color: #3a81c3; font-weight: bold;">SELECT</span> * <span style="color: #3a81c3; font-weight: bold;">FROM</span> myisam_table;
</pre>
</div>
<p>
For large volume data:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">START</span> <span style="color: #3a81c3; font-weight: bold;">TRANSACTION</span>;
<span style="color: #3a81c3; font-weight: bold;">INSERT</span> <span style="color: #3a81c3; font-weight: bold;">INTO</span> innodb_table <span style="color: #3a81c3; font-weight: bold;">SELECT</span> * <span style="color: #3a81c3; font-weight: bold;">FROM</span> myisam_table <span style="color: #3a81c3; font-weight: bold;">WHERE</span> id <span style="color: #3a81c3; font-weight: bold;">BETWEEN</span> x <span style="color: #3a81c3; font-weight: bold;">AND</span> y;
<span style="color: #3a81c3; font-weight: bold;">COMMIT</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org63cfc5e" class="outline-4">
<h4 id="org63cfc5e"><span class="section-number-4">2.1.4</span> Online schema change</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
<i>pt-online-schema-change</i> (based on Facebook’s online schema change technique)
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org21c9fd1" class="outline-2">
<h2 id="org21c9fd1"><span class="section-number-2">3</span> Benchmark</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb918a3b" class="outline-3">
<h3 id="orgb918a3b"><span class="section-number-3">3.1</span> What to Measure</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org6fbe6f9" class="outline-4">
<h4 id="org6fbe6f9"><span class="section-number-4">3.1.1</span> Throughput</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Throughput is defined as the number of transactions per unit of time. The usual unit of measurement is
transactions per second(TPS), although it is sometimes transactions per minute(TPM).
</p>
</div>
</div>

<div id="outline-container-orgf239c3a" class="outline-4">
<h4 id="orgf239c3a"><span class="section-number-4">3.1.2</span> Response time or latency</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This measures the total time a task requires.
</p>
</div>
</div>

<div id="outline-container-org46b8009" class="outline-4">
<h4 id="org46b8009"><span class="section-number-4">3.1.3</span> Concurrency</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Concurrency is an important but frequently misused and misunderstood metric. Concurrency benchmark shoud be
the number of threads or connections doing work simultaneously.
</p>
</div>
</div>

<div id="outline-container-org8d0ca33" class="outline-4">
<h4 id="org8d0ca33"><span class="section-number-4">3.1.4</span> Scalability</h4>
</div>
</div>

<div id="outline-container-org59309a1" class="outline-3">
<h3 id="org59309a1"><span class="section-number-3">3.2</span> Gathering Data on MySQL</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>specify user to execute <b>mysql</b> command
<code>mysql_config_editor set  --user=username  --host=127.0.0.1 --port=3306 --password</code></li>

<li>a sample shell script that you can use to gather data on MySQL during benchmarks</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">sh</span>
<span style="color: #715ab1;">INTERVAL</span>=5
<span style="color: #715ab1;">PREFIX</span>=$<span style="color: #715ab1;">INTERVAL</span>-sec-status
<span style="color: #715ab1;">RUNFILE</span>=/home/benchmark/running
mysql -e <span style="color: #2d9574;">'SHOW GLOBAL VARIABLES'</span> &gt;&gt; mysql-variables
<span style="color: #3a81c3; font-weight: bold;">while</span> test -e $<span style="color: #715ab1;">RUNFILE</span>; <span style="color: #3a81c3; font-weight: bold;">do</span>
    <span style="color: #715ab1;">file</span>=$(date +%F_%I)
    <span style="color: #715ab1;">sleep</span>=$(date +%s.%N | awk <span style="color: #2d9574;">"{print $INTERVAL - (\$1 % $INTERVAL)}"</span>)
    sleep $<span style="color: #715ab1;">sleep</span>
    <span style="color: #715ab1;">ts</span>=<span style="color: #2d9574;">"$(date +"TS %s.%N %F %T")"</span>
    <span style="color: #715ab1;">loadavg</span>=<span style="color: #2d9574;">"$(uptime)"</span>
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-status
    mysql -e <span style="color: #2d9574;">'SHOW GLOBAL STATUS'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-status &amp;
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-innodbstatus
    mysql -e <span style="color: #2d9574;">'SHOW ENGINE INNODB STATUS\G'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-innodbstatus &amp;
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-processlist
    mysql -e <span style="color: #2d9574;">'SHOW FULL PROCESSLIST\G'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-${<span style="color: #715ab1;">file</span>}-processlist &amp;
    <span style="color: #3a81c3;">echo</span> $<span style="color: #715ab1;">ts</span>
<span style="color: #3a81c3; font-weight: bold;">done</span>
<span style="color: #3a81c3;">echo</span> Exiting because $<span style="color: #715ab1;">RUNFILE</span> does not exist.
</pre>
</div>
</div>
</div>
