org/db/hpmysql.org
** Analyzing Results
   #+BEGIN_SRC awk
     #!/bin/sh
     awk '
     BEGIN {
       printf "#ts date time load QPS";
       fmt = " %.2f";
     }
     /^TS/ { # The timestamp lines begin with TS.
       ts = substr($2, 1, index($2, ".") - 1);
       load = NF - 2;
       diff = ts - prev_ts;
       prev_ts = ts;
       printf "\n%s %s %s %s", ts, $3, $4, substr($load, 1, length($load)-1);
     }
     /Queries/ {
       printf fmt, ($2-Queries)/diff;
       Queries=$2
     }
     ' "$@"
   #+END_SRC
*** plot
    #+BEGIN_SRC sh
      gnuplot> plot "filename" using 5 w lines title "QPS"
    #+END_SRC

** Tools
*** http_load
*** MySQL Benchmark Suite
    =mysqltest=
*** *sysbench*
**** cpu
     #+BEGIN_SRC sh
       sysbench cpu --cpu-max-prime=20000 --threads=4 run
     #+END_SRC

**** fileio
     | IO mode | description                |
     |---------+----------------------------|
     | seqwr   | Sequential write           |
     | seqrewr | Sequential rewrite         |
     | seqrd   | Sequential read            |
     | rndrd   | Random read                |
     | rndwr   | Random write               |
     | rndrw   | Combined random read/write |
     #+BEGIN_SRC sh
       sysbench fileio --file-total-size=21G prepare
       sysbench fileio --file-total-size=21G --file-test-mode=rndrw \
                --time=300 --max-requests=0 --threads=4 run
     #+END_SRC

**** oltp
     #+BEGIN_SRC sh
       sysbench --db-driver=mysql --mysql-host=127.0.0.1 --mysql-user=sbtest --mysql-password=test1234 \
                --mysql-db=test --table-size=100000 /usr/local/share/sysbench/oltp_common.lua prepare
       sysbench --db-driver=mysql --mysql-host=127.0.0.1 --mysql-user=sbtest --mysql-password=test1234 \
                --mysql-db=test --table-size=100000 /usr/local/share/sysbench/oltp_read_write.lua \
                --threads=4 run
     #+END_SRC

*** TPC-C
    TPC-C is a specification published by the TPC organization that emulates a complex online transaction-processing load.
**** dbt2
**** TPPC-MySQL
* Profiling
  - execution-time profiling
  - wait analysis
** slow query log
   related variables: =slow_query_log=, =long_query_time=
   - low-overhead on I/O-bound workloads
   - high-fidelity

*** pt-query-digest
    Analyze MySQL queries from logs, processlist, and tcpdump.
    =pt-query-digest [log_file]=

*** tcpdump
    Use =tcpdump= to capture TCP network traffic and inspecting it, then
    - use =pt-query-digest --type=tpcdump= to decode the MySQL client/server protocol

** Single Query Profiling
*** performance_schema
    #+BEGIN_SRC sql
      UPDATE performance_schema.setup_instruments SET ENABLED = 'YES', TIMED = 'YES' WHERE NAME LIKE '%statement/%';
      UPDATE performance_schema.setup_instruments SET ENABLED = 'YES', TIMED = 'YES' WHERE NAME LIKE '%stage/%';
      UPDATE performance_schema.setup_consumers SET ENABLED = 'YES' WHERE NAME LIKE '%events_statements_%';
      UPDATE performance_schema.setup_consumers SET ENABLED = 'YES' WHERE NAME LIKE '%events_stages_%';

      SELECT EVENT_ID, TRUNCATE(TIMER_WAIT/1000000000000,6) as Duration, SQL_TEXT
      FROM performance_schema.events_statements_history_long
      WHERE ... /*same as SHOW PROFILES*/

      SELECT event_name AS Stage, TRUNCATE(TIMER_WAIT/1000000000000,6) AS Duration
      FROM performance_schema.events_stages_history_long
      WHERE NESTING_EVENT_ID=... /*same as SHOW PROFILE FOR QUERY*/
    #+END_SRC
    results in =performance_schema.events_statements_history_long=

*** SHOW PROFILE[deprecated]
    #+BEGIN_SRC sql
      SET profiling=1;

      SHOW PROFILES;
      SHOW PROFILE FOR QUERY [Query_ID];
    #+END_SRC

*** SHOW STATUS
   #+BEGIN_SRC sql
     FLUSH STATUS;
     SHOW STATUS WHERE Variable_name LIKE 'Handler%' OR Variable_name LIKE 'Created%';
   #+END_SRC
