db/hpmysql.html

<div id="outline-container-org7635523" class="outline-3">
<h3 id="org7635523"><span class="section-number-3">3.3</span> Analyzing Results</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/sh</span>
awk '
<span style="color: #3a81c3; font-weight: bold;">BEGIN</span> {
  <span style="color: #6c3163;">printf</span> <span style="color: #2d9574;">"#ts date time load QPS"</span>;
  fmt = <span style="color: #2d9574;">" %.2f"</span>;
}
<span style="color: #2d9574;">/^TS/</span> { <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The timestamp lines begin with TS.</span>
  ts = <span style="color: #6c3163;">substr</span>($2, 1, <span style="color: #6c3163;">index</span>($2, <span style="color: #2d9574;">"."</span>) - 1);
  load = <span style="color: #715ab1;">NF</span> - 2;
  diff = ts - prev_ts;
  prev_ts = ts;
  <span style="color: #6c3163;">printf</span> <span style="color: #2d9574;">"\n%s %s %s %s"</span>, ts, $3, $4, <span style="color: #6c3163;">substr</span>($load, 1, <span style="color: #6c3163;">length</span>($load)-1);
}
<span style="color: #2d9574;">/Queries/</span> {
  <span style="color: #6c3163;">printf</span> fmt, ($2-Queries)/diff;
  Queries=$2
}
' <span style="color: #2d9574;">"$@"</span>
</pre>
</div>
</div>
<div id="outline-container-org89a7c59" class="outline-4">
<h4 id="org89a7c59"><span class="section-number-4">3.3.1</span> plot</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-sh">gnuplot&gt; plot <span style="color: #2d9574;">"filename"</span> using 5 w lines title <span style="color: #2d9574;">"QPS"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org81bec8c" class="outline-3">
<h3 id="org81bec8c"><span class="section-number-3">3.4</span> Tools</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orgcb6df5e" class="outline-4">
<h4 id="orgcb6df5e"><span class="section-number-4">3.4.1</span> http_load</h4>
</div>
<div id="outline-container-org03c9e81" class="outline-4">
<h4 id="org03c9e81"><span class="section-number-4">3.4.2</span> MySQL Benchmark Suite</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
<code>mysqltest</code>
</p>
</div>
</div>
<div id="outline-container-orgcd27954" class="outline-4">
<h4 id="orgcd27954"><span class="section-number-4">3.4.3</span> <b>sysbench</b></h4>
<div class="outline-text-4" id="text-3-4-3">
</div>
<ul class="org-ul">
<li><a id="org89fe774"></a>cpu<br />
<div class="outline-text-5" id="text-org89fe774">
<div class="org-src-container">
<pre class="src src-sh">sysbench cpu --cpu-max-prime=20000 --threads=4 run
</pre>
</div>
</div>
</li>

<li><a id="orgf911c5e"></a>fileio<br />
<div class="outline-text-5" id="text-orgf911c5e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">IO mode</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">seqwr</td>
<td class="org-left">Sequential write</td>
</tr>

<tr>
<td class="org-left">seqrewr</td>
<td class="org-left">Sequential rewrite</td>
</tr>

<tr>
<td class="org-left">seqrd</td>
<td class="org-left">Sequential read</td>
</tr>

<tr>
<td class="org-left">rndrd</td>
<td class="org-left">Random read</td>
</tr>

<tr>
<td class="org-left">rndwr</td>
<td class="org-left">Random write</td>
</tr>

<tr>
<td class="org-left">rndrw</td>
<td class="org-left">Combined random read/write</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-sh">sysbench fileio --file-total-size=21G prepare
sysbench fileio --file-total-size=21G --file-test-mode=rndrw <span style="color: #2d9574;">\</span>
         --time=300 --max-requests=0 --threads=4 run
</pre>
</div>
</div>
</li>

<li><a id="org1f4b869"></a>oltp<br />
<div class="outline-text-5" id="text-org1f4b869">
<div class="org-src-container">
<pre class="src src-sh">sysbench --db-driver=mysql --mysql-host=127.0.0.1 --mysql-user=sbtest --mysql-pa<span style="color: #6c4173;">ssword=test1234 </span><span style="color: #6c4173;">\</span>
         --mysql-db=test --table-size=100000 /usr/local/share/sysbench/oltp_comm<span style="color: #6c4173;">on.lua prepare</span>
sysbench --db-driver=mysql --mysql-host=127.0.0.1 --mysql-user=sbtest --mysql-pa<span style="color: #6c4173;">ssword=test1234 </span><span style="color: #6c4173;">\</span>
         --mysql-db=test --table-size=100000 /usr/local/share/sysbench/oltp_read<span style="color: #6c4173;">_write.lua </span><span style="color: #6c4173;">\</span>
         --threads=4 run
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5231ab9" class="outline-4">
<h4 id="org5231ab9"><span class="section-number-4">3.4.4</span> TPC-C</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
TPC-C is a specification published by the TPC organization that emulates a complex online transaction-processing load.
</p>
</div>
<ul class="org-ul">
<li><a id="org8de40c6"></a>dbt2<br /></li>
<li><a id="org5e526d9"></a>TPPC-MySQL<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2ea7981" class="outline-2">
<h2 id="org2ea7981"><span class="section-number-2">4</span> Profiling</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>execution-time profiling</li>
<li>wait analysis</li>
</ul>
</div>
<div id="outline-container-org7a3113e" class="outline-3">
<h3 id="org7a3113e"><span class="section-number-3">4.1</span> slow query log</h3>
<div class="outline-text-3" id="text-4-1">
<p>
related variables: <code>slow_query_log</code>, <code>long_query_time</code>
</p>
<ul class="org-ul">
<li>low-overhead on I/O-bound workloads</li>
<li>high-fidelity</li>
</ul>
</div>

<div id="outline-container-org9aec1da" class="outline-4">
<h4 id="org9aec1da"><span class="section-number-4">4.1.1</span> pt-query-digest</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Analyze MySQL queries from logs, processlist, and tcpdump.
<code>pt-query-digest [log_file]</code>
</p>
</div>
</div>

<div id="outline-container-org7a9408b" class="outline-4">
<h4 id="org7a9408b"><span class="section-number-4">4.1.2</span> tcpdump</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Use <code>tcpdump</code> to capture TCP network traffic and inspecting it, then
</p>
<ul class="org-ul">
<li>use <code>pt-query-digest --type=tpcdump</code> to decode the MySQL client/server protocol</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0c0333e" class="outline-3">
<h3 id="org0c0333e"><span class="section-number-3">4.2</span> Single Query Profiling</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgbf9d2a8" class="outline-4">
<h4 id="orgbf9d2a8"><span class="section-number-4">4.2.1</span> performance_schema</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">UPDATE</span> performance_schema.setup_instruments <span style="color: #3a81c3; font-weight: bold;">SET</span> ENABLED = <span style="color: #2d9574;">'YES'</span>, TIMED = <span style="color: #2d9574;">'YES'</span> <span style="color: #3a81c3; font-weight: bold;">W</span><span style="color: #6c4173; font-weight: bold;">HERE</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">NAME</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">LIKE</span><span style="color: #6c4173;"> </span><span style="color: #6c4173;">'%statement/%'</span><span style="color: #6c4173;">;</span>
<span style="color: #3a81c3; font-weight: bold;">UPDATE</span> performance_schema.setup_instruments <span style="color: #3a81c3; font-weight: bold;">SET</span> ENABLED = <span style="color: #2d9574;">'YES'</span>, TIMED = <span style="color: #2d9574;">'YES'</span> <span style="color: #3a81c3; font-weight: bold;">W</span><span style="color: #6c4173; font-weight: bold;">HERE</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">NAME</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">LIKE</span><span style="color: #6c4173;"> </span><span style="color: #6c4173;">'%stage/%'</span><span style="color: #6c4173;">;</span>
<span style="color: #3a81c3; font-weight: bold;">UPDATE</span> performance_schema.setup_consumers <span style="color: #3a81c3; font-weight: bold;">SET</span> ENABLED = <span style="color: #2d9574;">'YES'</span> <span style="color: #3a81c3; font-weight: bold;">WHERE</span> <span style="color: #3a81c3; font-weight: bold;">NAME</span> <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'%</span><span style="color: #6c4173;">events_statements_%'</span><span style="color: #6c4173;">;</span>
<span style="color: #3a81c3; font-weight: bold;">UPDATE</span> performance_schema.setup_consumers <span style="color: #3a81c3; font-weight: bold;">SET</span> ENABLED = <span style="color: #2d9574;">'YES'</span> <span style="color: #3a81c3; font-weight: bold;">WHERE</span> <span style="color: #3a81c3; font-weight: bold;">NAME</span> <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'%</span><span style="color: #6c4173;">events_stages_%'</span><span style="color: #6c4173;">;</span>

<span style="color: #3a81c3; font-weight: bold;">SELECT</span> EVENT_ID, TRUNCATE(TIMER_WAIT/1000000000000,6) <span style="color: #3a81c3; font-weight: bold;">as</span> Duration, SQL_TEXT
<span style="color: #3a81c3; font-weight: bold;">FROM</span> performance_schema.events_statements_history_long
<span style="color: #3a81c3; font-weight: bold;">WHERE</span> ... <span style="color: #2aa1ae; background-color: #ecf3ec;">/*</span><span style="color: #2aa1ae; background-color: #ecf3ec;">same as SHOW PROFILES*/</span>

<span style="color: #3a81c3; font-weight: bold;">SELECT</span> event_name <span style="color: #3a81c3; font-weight: bold;">AS</span> Stage, TRUNCATE(TIMER_WAIT/1000000000000,6) <span style="color: #3a81c3; font-weight: bold;">AS</span> Duration
<span style="color: #3a81c3; font-weight: bold;">FROM</span> performance_schema.events_stages_history_long
<span style="color: #3a81c3; font-weight: bold;">WHERE</span> NESTING_EVENT_ID=... <span style="color: #2aa1ae; background-color: #ecf3ec;">/*</span><span style="color: #2aa1ae; background-color: #ecf3ec;">same as SHOW PROFILE FOR QUERY*/</span>
</pre>
</div>
<p>
results in <code>performance_schema.events_statements_history_long</code>
</p>
</div>
</div>

<div id="outline-container-orgce563ff" class="outline-4">
<h4 id="orgce563ff"><span class="section-number-4">4.2.2</span> SHOW PROFILE[deprecated]</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SET</span> profiling=1;

SHOW PROFILES;
SHOW PROFILE <span style="color: #3a81c3; font-weight: bold;">FOR</span> QUERY [Query_ID];
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfc0f30" class="outline-4">
<h4 id="orgdfc0f30"><span class="section-number-4">4.2.3</span> SHOW STATUS</h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">
<pre class="src src-sql">FLUSH STATUS;
SHOW STATUS <span style="color: #3a81c3; font-weight: bold;">WHERE</span> Variable_name <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'Handler%'</span> <span style="color: #3a81c3; font-weight: bold;">OR</span> Variable_name <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'Created%'</span><span style="color: #6c4173;">;</span>
</pre>
</div>
</div>
</div>
