org/db/hpmysql.org
*** EXPLAIN
   #+BEGIN_SRC sql
     EXPLAIN [SQL_QUERY]
   #+END_SRC

** Server-Wide Problem Detection
*** sysstat
    - iostat, vmstat
*** SHOW GLOBAL STATUS
    Run =SHOW GLOBAL STATUS= periodically, gather Threads_running, Threads_connected, Questions, and Queries.
    #+BEGIN_SRC sh
      mysqladmin ext -i1 -p | awk '
          /Queries/{q=$4-qp;qp=$4}
          /Threads_connected/{tc=$4}
          /Threads_running/{printf "%5d %5d %5d\n", q, tc, $4}'
    #+END_SRC
*** SHOW PROCESSLIST
    #+BEGIN_SRC sh
      mysql -e 'SHOW PROCESSLIST\G' -p | grep State: | sort | uniq -c | sort -rn
    #+END_SRC
**** other approaches
     - PROCESSLIST table
    #+BEGIN_SRC sql
      SELECT * FROM INFORMATION_SCHEMA.PROCESSLIST;
    #+END_SRC
    - =innotop= command
*** SHOW INNODB STATUS
*** analyze slow log
    #+BEGIN_SRC sh
      awk '/^# Time:/{print $3, $4, c;c=0}/^# User/{c++}' slow-query.log
    #+END_SRC

*** *oprofile*
    primary Linux system profiling tool

*** *pt-stalk*
    Collect forensic data about MySQL when problems occur.
    - =pt-sift=: Browses files created by =pt-stalk=

*** =pt-mysql-summary= & =pt-summary=
*** *pt-pmp*
    Aggregate GDB stack traces for a selected program

** Tools
*** USER_STATISTICS
    =SHOW TABLES FROM INFORMATION_SCHEMA LIKE '%_STATISTICS';= in MariaDB
*** strace
    Use =strace= to intercepts system calls
    #+BEGIN_SRC sh
      strace -cfp [PID]
    #+END_SRC
* Schema
** Data Type
*** Priciples
    - Smaller is usually better
    - Simple is good
    - Avoid NULL if possible

*** SET
    stores bits. useful for ACL(Access Control List)
    #+BEGIN_SRC sql
      CREATE TABLE acl (
             perms SET('CAN_READ', 'CAN_WRITE', 'CAN_DELETE') NOT NULL
      );
      INSERT INTO acl (perms) VALUES ('CAN_READ,CAN_WRITE');
      SELECT perms FROM acl WHERE FIND_IN_SET('CAN_READ', perms);
    #+END_SRC
    - stores SET types internally as integers but converts them to strings when doing comparisons.

*** UUID
    - recommend using *BINARY(16)* type
** Normalization and Denormalization
*** Normalization
    Benefits:
    - Normalized updates are usually faster than denormalized updates
    - Normalized tables are usually smaller, so they fit better in memory and perform better
    - The lack of redundant data means there's less need for DISTINCT or GROUP BY queries when retrieving lists of values

    Drawbacks:
    - requires more joins

*** Denormalization
    Benefits:
    - avoids joins
    - allow more efficient indexing strategies
** Summary Table & Cache Table
   - summary tables: hold aggregated data from GROUP BY queries
   - cache tables: contain data that can be easily retrieved from the schema(i.e., data that is logically redundant).
*** Flexviews
    - offer materialized views
** Speeding Up ALTER TABLE
*** Default
    MySQL performs most alterations by making an empty table with the desired new
    structure, inserting all the data from the old table into the new one, and deleting the old table.
*** Alternatives
    - Performing the ALTER on servers that are not in production service
    - Shadow copy: build a new table with the desired structure beside the existing one,
    and then perform a rename and drop to swap the two.
**** Shadow copy tool
     - "online schema change" from facebook
     - openark
     - Percona Toolkit
** Indexing Methods
*** B-tree
    - column order in a index is extremely important
**** B+Tree
     data is on the leaf node.
**** Limitation
     - lookup does not start from the leftmost side of the indexed columns
     - you can't skip columns in the index.
     e.g. index(col1, col2, col3) need to specify a value to col2 if value of col3 is given
     - The storage engine can’t optimize accesses with any columns to the right of the first range condition.
     e.g. col2 LIKE 'abc%' <- range condition, then col3=="somevalue" won't be optimized.

*** Hash
    - only the Memory storage engine supports explicit hash indexes
