db/hpmysql.html
<div id="outline-container-orgfb65b63" class="outline-4">
<h4 id="orgfb65b63"><span class="section-number-4">4.2.4</span> EXPLAIN</h4>
<div class="outline-text-4" id="text-4-2-4">
<div class="org-src-container">
<pre class="src src-sql">EXPLAIN [SQL_QUERY]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org35d3f36" class="outline-3">
<h3 id="org35d3f36"><span class="section-number-3">4.3</span> Server-Wide Problem Detection</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org9978fdf" class="outline-4">
<h4 id="org9978fdf"><span class="section-number-4">4.3.1</span> sysstat</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>iostat, vmstat</li>
</ul>
</div>
</div>
<div id="outline-container-org6bda23e" class="outline-4">
<h4 id="org6bda23e"><span class="section-number-4">4.3.2</span> SHOW GLOBAL STATUS</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Run <code>SHOW GLOBAL STATUS</code> periodically, gather Threads_running, Threads_connected, Questions, and Queries.
</p>
<div class="org-src-container">
<pre class="src src-sh">mysqladmin ext -i1 -p | awk <span style="color: #2d9574;">'</span>
<span style="color: #2d9574;">    /Queries/{q=$4-qp;qp=$4}</span>
<span style="color: #2d9574;">    /Threads_connected/{tc=$4}</span>
<span style="color: #2d9574;">    /Threads_running/{printf "%5d %5d %5d\n", q, tc, $4}'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ba0ac4" class="outline-4">
<h4 id="org6ba0ac4"><span class="section-number-4">4.3.3</span> SHOW PROCESSLIST</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">
<pre class="src src-sh">mysql -e <span style="color: #2d9574;">'SHOW PROCESSLIST\G'</span> -p | grep State: | sort | uniq -c | sort -rn
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgb423ad6"></a>other approaches<br />
<div class="outline-text-5" id="text-orgb423ad6">
<ul class="org-ul">
<li>PROCESSLIST table</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SELECT</span> * <span style="color: #3a81c3; font-weight: bold;">FROM</span> INFORMATION_SCHEMA.PROCESSLIST;
</pre>
</div>
<ul class="org-ul">
<li><code>innotop</code> command</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org466c5d7" class="outline-4">
<h4 id="org466c5d7"><span class="section-number-4">4.3.4</span> SHOW INNODB STATUS</h4>
</div>
<div id="outline-container-org96913ae" class="outline-4">
<h4 id="org96913ae"><span class="section-number-4">4.3.5</span> analyze slow log</h4>
<div class="outline-text-4" id="text-4-3-5">
<div class="org-src-container">
<pre class="src src-sh">awk <span style="color: #2d9574;">'/^# Time:/{print $3, $4, c;c=0}/^# User/{c++}'</span> slow-query.log
</pre>
</div>
</div>
</div>

<div id="outline-container-org97bd4fd" class="outline-4">
<h4 id="org97bd4fd"><span class="section-number-4">4.3.6</span> <b>oprofile</b></h4>
<div class="outline-text-4" id="text-4-3-6">
<p>
primary Linux system profiling tool
</p>
</div>
</div>

<div id="outline-container-orgca9c26c" class="outline-4">
<h4 id="orgca9c26c"><span class="section-number-4">4.3.7</span> <b>pt-stalk</b></h4>
<div class="outline-text-4" id="text-4-3-7">
<p>
Collect forensic data about MySQL when problems occur.
</p>
<ul class="org-ul">
<li><code>pt-sift</code>: Browses files created by <code>pt-stalk</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6629c20" class="outline-4">
<h4 id="org6629c20"><span class="section-number-4">4.3.8</span> <code>pt-mysql-summary</code> &amp; <code>pt-summary</code></h4>
</div>
<div id="outline-container-orga7d5e91" class="outline-4">
<h4 id="orga7d5e91"><span class="section-number-4">4.3.9</span> <b>pt-pmp</b></h4>
<div class="outline-text-4" id="text-4-3-9">
<p>
Aggregate GDB stack traces for a selected program
</p>
</div>
</div>
</div>

<div id="outline-container-org82e3630" class="outline-3">
<h3 id="org82e3630"><span class="section-number-3">4.4</span> Tools</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org1828113" class="outline-4">
<h4 id="org1828113"><span class="section-number-4">4.4.1</span> USER_STATISTICS</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
<code>SHOW TABLES FROM INFORMATION_SCHEMA LIKE '%_STATISTICS';</code> in MariaDB
</p>
</div>
</div>
<div id="outline-container-org1267ba9" class="outline-4">
<h4 id="org1267ba9"><span class="section-number-4">4.4.2</span> strace</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Use <code>strace</code> to intercepts system calls
</p>
<div class="org-src-container">
<pre class="src src-sh">strace -cfp [PID]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org0f5d093" class="outline-2">
<h2 id="org0f5d093"><span class="section-number-2">5</span> Schema</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org272698a" class="outline-3">
<h3 id="org272698a"><span class="section-number-3">5.1</span> Data Type</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org6f15ad1" class="outline-4">
<h4 id="org6f15ad1"><span class="section-number-4">5.1.1</span> Priciples</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>Smaller is usually better</li>
<li>Simple is good</li>
<li>Avoid NULL if possible</li>
</ul>
</div>
</div>

<div id="outline-container-org8027c24" class="outline-4">
<h4 id="org8027c24"><span class="section-number-4">5.1.2</span> SET</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
stores bits. useful for ACL(Access Control List)
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">CREATE</span> <span style="color: #3a81c3; font-weight: bold;">TABLE</span> <span style="color: #6c3163; font-weight: bold;">acl</span> (
       perms <span style="color: #3a81c3; font-weight: bold;">SET</span>(<span style="color: #2d9574;">'CAN_READ'</span>, <span style="color: #2d9574;">'CAN_WRITE'</span>, <span style="color: #2d9574;">'CAN_DELETE'</span>) <span style="color: #3a81c3; font-weight: bold;">NOT</span> <span style="color: #3a81c3; font-weight: bold;">NULL</span>
);
<span style="color: #3a81c3; font-weight: bold;">INSERT</span> <span style="color: #3a81c3; font-weight: bold;">INTO</span> acl (perms) <span style="color: #3a81c3; font-weight: bold;">VALUES</span> (<span style="color: #2d9574;">'CAN_READ,CAN_WRITE'</span>);
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> perms <span style="color: #3a81c3; font-weight: bold;">FROM</span> acl <span style="color: #3a81c3; font-weight: bold;">WHERE</span> FIND_IN_SET(<span style="color: #2d9574;">'CAN_READ'</span>, perms);
</pre>
</div>
<ul class="org-ul">
<li>stores SET types internally as integers but converts them to strings when doing comparisons.</li>
</ul>
</div>
</div>

<div id="outline-container-org7a5dc15" class="outline-4">
<h4 id="org7a5dc15"><span class="section-number-4">5.1.3</span> UUID</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li>recommend using <b>BINARY(16)</b> type</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgea54d6f" class="outline-3">
<h3 id="orgea54d6f"><span class="section-number-3">5.2</span> Normalization and Denormalization</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org127e1e9" class="outline-4">
<h4 id="org127e1e9"><span class="section-number-4">5.2.1</span> Normalization</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
Benefits:
</p>
<ul class="org-ul">
<li>Normalized updates are usually faster than denormalized updates</li>
<li>Normalized tables are usually smaller, so they fit better in memory and perform better</li>
<li>The lack of redundant data means there's less need for DISTINCT or GROUP BY queries when retrieving lists of values</li>
</ul>

<p>
Drawbacks:
</p>
<ul class="org-ul">
<li>requires more joins</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6aa825" class="outline-4">
<h4 id="orgf6aa825"><span class="section-number-4">5.2.2</span> Denormalization</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
Benefits:
</p>
<ul class="org-ul">
<li>avoids joins</li>
<li>allow more efficient indexing strategies</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge0c3305" class="outline-3">
<h3 id="orge0c3305"><span class="section-number-3">5.3</span> Summary Table &amp; Cache Table</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>summary tables: hold aggregated data from GROUP BY queries</li>
<li>cache tables: contain data that can be easily retrieved from the schema(i.e., data that is logically redundant).</li>
</ul>
</div>
<div id="outline-container-org149800d" class="outline-4">
<h4 id="org149800d"><span class="section-number-4">5.3.1</span> Flexviews</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li>offer materialized views</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org34b1ea3" class="outline-3">
<h3 id="org34b1ea3"><span class="section-number-3">5.4</span> Speeding Up ALTER TABLE</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org70783e6" class="outline-4">
<h4 id="org70783e6"><span class="section-number-4">5.4.1</span> Default</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
MySQL performs most alterations by making an empty table with the desired new
structure, inserting all the data from the old table into the new one, and deleting the old table.
</p>
</div>
</div>
<div id="outline-container-org04ddc9b" class="outline-4">
<h4 id="org04ddc9b"><span class="section-number-4">5.4.2</span> Alternatives</h4>
<div class="outline-text-4" id="text-5-4-2">
<ul class="org-ul">
<li>Performing the ALTER on servers that are not in production service</li>
<li>Shadow copy: build a new table with the desired structure beside the existing one,</li>
</ul>
<p>
and then perform a rename and drop to swap the two.
</p>
</div>
<ul class="org-ul">
<li><a id="org929cf2e"></a>Shadow copy tool<br />
<div class="outline-text-5" id="text-org929cf2e">
<ul class="org-ul">
<li>"online schema change" from facebook</li>
<li>openark</li>
<li>Percona Toolkit</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org998a299" class="outline-3">
<h3 id="org998a299"><span class="section-number-3">5.5</span> Indexing Methods</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orgee9eb8e" class="outline-4">
<h4 id="orgee9eb8e"><span class="section-number-4">5.5.1</span> B-tree</h4>
<div class="outline-text-4" id="text-5-5-1">
<ul class="org-ul">
<li>column order in a index is extremely important</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org088c2f6"></a>B+Tree<br />
<div class="outline-text-5" id="text-org088c2f6">
<p>
data is on the leaf node.
</p>
</div>
</li>
<li><a id="org828c061"></a>Limitation<br />
<div class="outline-text-5" id="text-org828c061">
<ul class="org-ul">
<li>lookup does not start from the leftmost side of the indexed columns</li>
<li>you can't skip columns in the index.</li>
</ul>
<p>
e.g. index(col1, col2, col3) need to specify a value to col2 if value of col3 is given
</p>
<ul class="org-ul">
<li>The storage engine can’t optimize accesses with any columns to the right of the first range condition.</li>
</ul>
<p>
e.g. col2 LIKE 'abc%' &lt;- range condition, then col3=="somevalue" won't be optimized.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgef89aa1" class="outline-4">
<h4 id="orgef89aa1"><span class="section-number-4">5.5.2</span> Hash</h4>
<div class="outline-text-4" id="text-5-5-2">
<ul class="org-ul">
<li>only the Memory storage engine supports explicit hash indexes</li>
</ul>
</div>
<ul class="org-ul">
