db/hpmysql.html
<li><a id="org4d8a785"></a>InnoDB<br />
<div class="outline-text-5" id="text-org4d8a785">
<p>
<i>adaptive hash indexes</i>: When InnoDB notices that some index values are being accessed very frequently,
it builds a hash index for them in memory on top of B-Tree indexes.
</p>
</div>
</li>

<li><a id="orgf4652f2"></a>Building hash indexes<br />
<div class="outline-text-5" id="text-orgf4652f2">
<ol class="org-ol">
<li>add hash column</li>
<li>create trigger on <code>insert</code> and <code>update</code></li>
<li><code>select</code> by hash value</li>
</ol>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SELECT</span> id <span style="color: #3a81c3; font-weight: bold;">FROM</span> url <span style="color: #3a81c3; font-weight: bold;">WHERE</span> url_crc=CRC32("http://www.mysql.com")
       <span style="color: #3a81c3; font-weight: bold;">AND</span> url="http://www.mysql.com"; <span style="color: #2aa1ae; background-color: #ecf3ec;">-- Search in collision</span>
</pre>
</div>
<ul class="org-ul">
<li>hash functions: CRC32, FNV64, SHA1, MD5</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgee97376" class="outline-4">
<h4 id="orgee97376"><span class="section-number-4">5.5.3</span> R-Tree</h4>
<div class="outline-text-4" id="text-5-5-3">
<ul class="org-ul">
<li>index GEOMETRY information</li>
<li>MyISAM supports R-Tree</li>
</ul>
</div>
</div>

<div id="outline-container-orge844439" class="outline-4">
<h4 id="orge844439"><span class="section-number-4">5.5.4</span> Full-text</h4>
<div class="outline-text-4" id="text-5-5-4">
<p>
Full-text is a special type of index that finds keywords in the text instead of comparing values directly to the values in the index.
</p>
</div>
</div>
</div>
<div id="outline-container-org0cb66e4" class="outline-3">
<h3 id="org0cb66e4"><span class="section-number-3">5.6</span> Indexing Strategies</h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-org4a916d3" class="outline-4">
<h4 id="org4a916d3"><span class="section-number-4">5.6.1</span> Long string index</h4>
<div class="outline-text-4" id="text-5-6-1">
</div>
<ul class="org-ul">
<li><a id="org0679191"></a>one approach: simulate a hash index<br /></li>
<li><a id="orgee40450"></a>indexing the first few characters<br />
<div class="outline-text-5" id="text-orgee40450">
<p>
Index selectivity is the ratio of the number of distinct indexed values (the cardinality) to the total number of rows in the table.
Choose a prefix that’s long enough to give good selectivity, but short enough to save space
</p>

<ul class="org-ul">
<li>one way: try to compare occurrences of each distinct indexed values for each prefix</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SELECT</span> <span style="color: #3a81c3;">COUNT</span>(*) <span style="color: #3a81c3; font-weight: bold;">AS</span> cnt, city <span style="color: #3a81c3; font-weight: bold;">FROM</span> sakila.city_demo <span style="color: #3a81c3; font-weight: bold;">GROUP</span> <span style="color: #3a81c3; font-weight: bold;">BY</span> city <span style="color: #3a81c3; font-weight: bold;">ORDER</span> <span style="color: #3a81c3; font-weight: bold;">BY</span> cnt <span style="color: #3a81c3; font-weight: bold;">DE</span><span style="color: #6c4173; font-weight: bold;">SC</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">LIMIT</span><span style="color: #6c4173;"> 10;</span>
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> <span style="color: #3a81c3;">COUNT</span>(*) <span style="color: #3a81c3; font-weight: bold;">AS</span> cnt, <span style="color: #3a81c3; font-weight: bold;">LEFT</span>(city, 3) <span style="color: #3a81c3; font-weight: bold;">AS</span> pref <span style="color: #3a81c3; font-weight: bold;">FROM</span> sakila.city_demo <span style="color: #3a81c3; font-weight: bold;">GROUP</span> <span style="color: #3a81c3; font-weight: bold;">BY</span> pre<span style="color: #6c4173;">f </span><span style="color: #6c4173; font-weight: bold;">ORDER</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">BY</span><span style="color: #6c4173;"> cnt </span><span style="color: #6c4173; font-weight: bold;">DESC</span><span style="color: #6c4173;"> </span><span style="color: #6c4173; font-weight: bold;">LIMIT</span><span style="color: #6c4173;"> 10;</span>
</pre>
</div>

<ul class="org-ul">
<li>another way: computing the full column's selectivity and trying to make the prefix's selectivity close to that value.</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SELECT</span> <span style="color: #3a81c3;">COUNT</span>(<span style="color: #3a81c3; font-weight: bold;">DISTINCT</span> city)/<span style="color: #3a81c3;">COUNT</span>(*) <span style="color: #3a81c3; font-weight: bold;">FROM</span> sakila.city_demo;
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> <span style="color: #3a81c3;">COUNT</span>(<span style="color: #3a81c3; font-weight: bold;">DISTINCT</span> <span style="color: #3a81c3; font-weight: bold;">LEFT</span>(city, 3))/<span style="color: #3a81c3;">COUNT</span>(*) <span style="color: #3a81c3; font-weight: bold;">AS</span> sel3,
       <span style="color: #3a81c3;">COUNT</span>(<span style="color: #3a81c3; font-weight: bold;">DISTINCT</span> <span style="color: #3a81c3; font-weight: bold;">LEFT</span>(city, 4))/<span style="color: #3a81c3;">COUNT</span>(*) <span style="color: #3a81c3; font-weight: bold;">AS</span> sel4,
<span style="color: #3a81c3; font-weight: bold;">FROM</span> sakila.city_demo;
</pre>
</div>

<ul class="org-ul">
<li>downside: MySQL cannot use prefix indexes for ORDER BY or GROUP BY queries, nor can it use them as covering indexes.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgab74c6c" class="outline-4">
<h4 id="orgab74c6c"><span class="section-number-4">5.6.2</span> Multicolumn Indexes</h4>
<div class="outline-text-4" id="text-5-6-2">
<ul class="org-ul">
<li><p>
Individual indexes on lots of columns won’t help MySQL improve performance for most queries
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SELECT</span> col1, col2 <span style="color: #3a81c3; font-weight: bold;">FROM</span> tbl <span style="color: #3a81c3; font-weight: bold;">WHERE</span> index1=1 <span style="color: #3a81c3; font-weight: bold;">or</span> index2=1;
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- will translate to</span>
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> col1, col2 <span style="color: #3a81c3; font-weight: bold;">FROM</span> tbl <span style="color: #3a81c3; font-weight: bold;">WHERE</span> index1=1
<span style="color: #3a81c3; font-weight: bold;">UNION</span> <span style="color: #3a81c3; font-weight: bold;">ALL</span>
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> col1, col2 <span style="color: #3a81c3; font-weight: bold;">FROM</span> tbl <span style="color: #3a81c3; font-weight: bold;">WHERE</span> index2=1 <span style="color: #3a81c3; font-weight: bold;">AND</span> index1 &lt;&gt; 1;
</pre>
</div>
<p>
Use <code>EXPLAIN</code> to check
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb262d3" class="outline-4">
<h4 id="orgdb262d3"><span class="section-number-4">5.6.3</span> Choosing a Good Column Order</h4>
<div class="outline-text-4" id="text-5-6-3">
<p>
Choose the index order such that rows are sorted and grouped in a way that will benefit the query
The order of columns in a multicolumn B-Tree index means that the index is sorted first by the
leftmost column, then by the next column, and so on.
</p>
</div>
</div>
</div>

<div id="outline-container-org923cef0" class="outline-3">
<h3 id="org923cef0"><span class="section-number-3">5.7</span> Clustered Indexes</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Clustered index is an approach to data storage.
</p>
<ul class="org-ul">
<li>InnoDB's clustered indexes actually store a B-Tree index and the rows together in the same structure.</li>
</ul>
</div>
</div>

<div id="outline-container-org2727701" class="outline-3">
<h3 id="org2727701"><span class="section-number-3">5.8</span> Covering Indexes</h3>
<div class="outline-text-3" id="text-5-8">
<p>
An index that contains (or “covers”) all the data needed to satisfy a query is called a <b>covering index</b>.
</p>
<ul class="org-ul">
<li>Covering indexes are especially helpful for InnoDB tables, because of InnoDB’s clustered indexes</li>
<li>When you issue a query that is an index-covered query, you’ll see “Using index” in the <i>Extra</i> column in <i>EXPLAIN</i></li>
</ul>
</div>
<div id="outline-container-org5e2768b" class="outline-4">
<h4 id="org5e2768b"><span class="section-number-4">5.8.1</span> Benefits</h4>
<div class="outline-text-4" id="text-5-8-1">
<ul class="org-ul">
<li>reduce random I/O</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org267a0c3" class="outline-3">
<h3 id="org267a0c3"><span class="section-number-3">5.9</span> Using Index for Sorts</h3>
<div class="outline-text-3" id="text-5-9">
<p>
Ordering the results by the index works only when
</p>
<ul class="org-ul">
<li>the index’s order is exactly the same as the ORDER BY clause</li>
<li>and all columns are sorted in the same direction</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org76676a5" class="outline-2">
<h2 id="org76676a5"><span class="section-number-2">6</span> Query Optimization</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org2e43406" class="outline-3">
<h3 id="org2e43406"><span class="section-number-3">6.1</span> Isolating the Column</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Indexed column is alone on one side of the comparison operator.
Wrong Examples: <code>WHERE id+2=5</code>, <code>WHERE SUM(id)=10</code>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
